#include "stdio.h"
#include "string.h"
#include "stdbool.h"

void main(){
    //? การประกาศตัวแปรชนิด string ทำได้ 2 แบบคือ

    //* แบบที่ 1 ใช้ [จำนวนอักขระของที่ใส่ได้สูงสุดในข้อความ - 1] ต่อท้ายชื่อของตัวแปร
    char str1[10] = "my string";
    /*
        วิธีนี้ไม่ค่อยแนะนำและมีข้อจำกัดในการใช้งานหลายอย่าง เช่น
    การเปลี่ยนค่าหรือแก้ไขค่าข้อความ จะไม่สามารถใช้ = ในการแก้ไขตรงๆได้จะต้อใช้ function ที่อยู่ใน 
    header string.h มาช่วยจัดการ 
    str1 = "new string"  // ไม่สามาระแก้ไขค่าได้เกิด error
    str1cpy(str1, "new string")  // ใช้ function strcpy ในการแก้ไขค่าได้
    */

    //* แบบที่ 2 ใช้ * นำหน้าชื่อตัวแปร ใช้ pointer ในการจัดการ string
    // วิธีนี้แนะนำให้ใช้งาน เพราะสามารถแก้ไขค่า string ตัวใหม่ได้เลยและยังสามารถใช้ในการเปรียบเทียบค่าได้
    char *str2 = "my string";
    str2 = "new string";
    bool check = str2 != "";
}