// การสร้างและกำหนดค่าของตัวแปร array
void main(){
    // ประกาศตัวแปร array ชนิด เลขจำนวนเต็ม
    // [จำนวน element] จะใส่เลขหรือไม่ใส่ก็ได้
    short arr1[6] = {1, 3, 5, 4, 4, 6};
    int arr2[7] = {10, 534, 56, 24, 56, 63, 77};
    long arr3[6] = {24 , 56 ,565 , 246, 76 ,3243};
    long long arr4[] = {34 , 56, 24 ,67 ,554564 ,65343 , 5465};

    // ประกาศตัวแปร array ชนิด เลขทศนิยม
    float arr5[4] = { 34.455 , 23.4 , 93.4 , 54.32};
    double arr6[4] = {12.3 , 54.0 , 53.556 , 34.556};

    // ประกาศตัวแปร array ชนิด อักขระ
    char arr7[4] = {'a' , 'f' , 'w' , 'd'};

    // ประกาศตัวแปร array ชนิดข้อความ
    // [จำนวนของ element] [ขนาดของข้อความ]
    char arr8[5][10] = {"ada" , "DQD" , "reww" , "3efr" , "grd"};

    // array แบบ 2 มิติ
    // [จำนวน elemnet ของ array ชั้นนอก] [จำนวน element ของ array ชั้นใน]
    int arr9[3][4] = {
        {1,3,4,5} , {13,4,5,7} , {234 , 4 ,67}
    };

    char arr10[4][2] = { 
        {'a' , 'b'} , {'c' , 'd'} , {'e' , 'f'} , {'g' , 'h'}
    };

    // [จำนวน element ของ array ชั้นนอก] [จำนวน element ของ array ชั้นใน] [ความยาวของข้อความ]
    char arr11[2][1][10] = {
        {"Hello"} , {"World}"}
    };
}