//? การสร้างและกำหนดค่าของตัวแปร array
void main(){
    //* ประกาศตัวแปร array ชนิด เลขจำนวนเต็ม
    // [จำนวน element] จะใส่เลขหรือไม่ใส่ก็ได้
    short nums[6] = {1, 3, 5, 4, 4, 6};
    int nums2[7] = {10, 534, 56, 24, 56, 63, 77};
    long nums3[6] = {24 , 56 ,565 , 246, 76 ,3243};
    long long nums4[] = {34 , 56, 24 ,67 ,554564 ,65343 , 5465};

    //* ประกาศตัวแปร array ชนิด เลขทศนิยม
    float nums5[4] = { 34.455 , 23.4 , 93.4 , 54.32};
    double nums6[4] = {12.3 , 54.0 , 53.556 , 34.556};

    //* ประกาศตัวแปร array ชนิด อักขระ
    char letters[4] = {'a' , 'b' , 'c' , 'd' , 'e' , 'f' , 'g'};

    //* ประกาศตัวแปร array ชนิดข้อความ
    // [จำนวนของ element] [จำนวนอักขระที่ใส่ได้สูงสุด - 1]
    char names[5][10] = {"john" , "jane" , "jack" , "jo" , "johd"};

    //* array แบบ 2 มิติ
    // [จำนวน elemnet ของ array ชั้นนอก] [จำนวน element ของ array ชั้นใน]
    int arr2d[3][4] = {
        {1,3,4,5} , {13,4,5,7} , {234 , 4 ,67}
    };

    char arr2d_1[4][2] = { 
        {'a' , 'b'} , {'c' , 'd'} , {'e' , 'f'} , {'g' , 'h'}
    };

    // [จำนวน element ของ array ชั้นนอก] [จำนวน element ของ array ชั้นใน] [จำนวนอักขระที่ใส่ได้สูงสุด - 1]
    char arr2d_2[2][1][10] = {
        {"Hello"} , {"World}"}
    };
}