#include <stdio.h>

int main()
{
    /*
            ? การจะแสดงข้อความในภาษา c มีเครื่องหมายให้ใช้ดังนี้
        * Double quote (" ") ใช้สำหรับแสดงข้อความ string
        * Single quote (' ') ใช้สำหรับตัวอักษร 1ตัวอักษร character หรือเรียกว่า char
    */

    /* ฟังชันก์การแสดงข้อความในภาษา c */

    // * ฟังชันก์ puts("ข้อความ") ต้องส่ง arg 1ตัวที่เป็น string ในเครื่องหมาย Double quote (" ") เท่านั้น
    puts("นี้คือข้อความ");
    puts("1 , 2 , 3"); // puts เวลาแสดงข้อความจะขึ้น บรรทัดใหม่ "\nข้อความ" ต่างจาก printf() ทีจะเรียงต่อกันในบรรทัดเดียว
    puts("4 , 5 , 6");
    puts("7 , 8 , 9 , 10");

    // * ฟังชันก์ putchar('ตัวอักษร') ส่ง arg 1ตัวเป็น char ตัวอักษร 1ตัวในเครื่องหมาย Single quote (' ') เท่านั้น
    putchar('a');
    putchar('b'); // การแสดงตัวอักษรฟังชันก์ putchar จะแสดงในบรรทัดเดียวกันติดกัน
    putchar('c');
    /*
        * อักขระพิเศษที่ใช้บ่อย
        \n ขึ้นบรรทัดใหม่ (Enter)
        \t เยื้องบรรทัด 1 tab
    */
    putchar('\n');

    // * ฟังชันก์ printf() ส่ง arg ได้หลายตัว โดยจะมีการจัดการกับข้อความที่จะแสดงจะมีการจัดการแสดงตามสัญลักษณ์ที่กำหนดขึ้นต้นด้วย %
    /*
            ? สัญลักษณ์ % ที่ใช้บ่อย 
        %d แสดงเลขจำนวนเต็ม
        %f แสดงเลขทศนิยม (6 หลักสามารถกำหนดให้ได้ว่าจะแสดงทศนิยมกี่ตำแหน่ง เช่น .2f แสดง ทศนิยม 2 ตำแหน่ง)
        %s แสดงข้อความ (ใช้เครื่องหมาย " " )
        %c แสดงตัวอักษร (ใช้เครื่องหมาย ' ')
        %g แสดงตัวเลขทศนิยมค่าจริงของมัน
        %e แสดงตัวเลขวิทยาศาสาตร์
        %lld แสดงตัวเลขชนิด long long
    */

    printf("%s %s" , "นี้คือการแสดงข้อความด้วย function" , "\"printf()\"");
    putchar('\n'); // เนื่องจาก ฟังชันก์ printf จะแสดงแค่ในบรรทัดเดียวทำให้ข้อความมันติดกันเราจึงต้องใช้ \n เพื่อขึ้นบรรทัดใหม่ในการแสดงข้อความ
    printf("%s%d%s" , "คะแนนของตุณคือ " , "100" , " คะแนนเต็ม");
    putchar('\n');
    printf("ภาษาโปรแกรมที่เขียนอยู่เรียกว่าภาษา %c" , 'C');
    putchar('\n');
    printf("%d + %d = %d" , 10 , 20 , 10 + 20);
    putchar('\n');

    int n1 = 1000;
    int n2= 300;
    const int n3 = n1 - n2;
    printf("%d - %d = %d" , n1 , n2 , n3);
    putchar('\n');

    float d1 = 3.244;
    float d2 = 4.3304;
    float d3 = 95.3;
    double d4 = (d1 / d2) * d3;
    printf("%f\n" , d4);
    printf("%.2f\n" , d4);
    printf("%g\n" , d4);

    char s1[7] = "I LOVE";
    char s2 = 'U';
    printf("%s %c" , s1 , s2);
}