#include <stdio.h>
#include <stdbool.h>

int main()
{
        /*
                ? หลักการสร้างตัวแปร
        * ไม่ใช้ชื่อตัวแปรเป็นชื่อคำสั่ง (คำสงวน)
        * การสร้างตัวแปรต้องขึ้น ชนิดข้อมูล ตามด้วยชื่อตัวแปร
        * ไม่ใช้ตัวเลขในคำแรกในการสร้างตัวแปรและเครื่องหมายใดๆยกเว้น 2 อันนี้ $ , _
        * ใช้สัญลักษณ์พิเศษในการสร้างตัวแปรถ้าต้องการตั้งชื่อเป็นคำสั่งให้ใช้ นำหน้าคำแรกในชื่อตัวแปร
        * เวลาสร้างตัวแปรชื่อตัวแปรต้องไม่ซ้ำกัน
        */

        /*
                ? ชนิดข้อมูลในภาษา c
        ? จำนวนเต็ม (เรียงลำดับจากค่าน้อยสุดไปมากสุด)
        * signed เป็นได้ทั้งจำนวน เต็มบวก(+) และ จำนวนเต็มลบ(-)
        * unsigned เป็นได้แค่ จำนวนเต็มบวกเ(+)ท่านั้น
        short
        int
        long
        long long

        * จำนวนทศนิยม (เรียงลำดับจากค่าน้อยสุดไปมากสุด)
        float
        double

        * ตัวอักษร อักขระ สัญลักษณ์
        char
                ! ข้อกำหนดในการใช้
        ! ใส่ได้แค่ตัวเดียวเท่านั้น
        ! ใช้เครื่องหหมาย Single quote ' ' เท่านั้น

        * ข้อความ
        char[ตัวเลข]
        หรือ
        char[]
                    ! ข้อกำหนดในการใช้
        ! ในการใช้ เมื่อใส่ เครื่องมาย array [] ให้ตัวแปรแล้วตัวแปรนั้นจะต้องกำหนดข้อความในบรรทัดนั้นทันที
        และไม่สามารถเปลี่ยนค่าในภายหลังได้
        ! ตัวเลขคือการกำหนดความยาวของข้อความ
        ! ให้ใช้เครื่องหมาย Double Quote " " เท่านั้น

        * ค่าจริง และ เท็จ
        bool
                    ! ข้อกำหนดในการใช้
        ! iclude module มาใช้งาน ชื่อ module คือ <stdbool.h>
        ! ใส่ได้แค่ true และ false
        */

        /* ตัวอย่างการสร้างตัวแปรและใช้งานชนิดของข้อมูล */
        short num1 = 3; // ถ้าค่าไม่ถึงหลักสิบ พยายามใช้ short
        short num2 = 8;
        short num3 = num1 + num3;
        short num4, num5 = 5, num6 = 9;
        num1 = 12;
        num3 = 4;
        num5 = 9;
        num6 = 11;

        int x, y, z;
        x = 12, y = 30, z = 93;
        int D = z + y - x;

        long num = 10000;
        long long bank = 10000000000;
        unsigned long money = 3485399444111453;

        char ch1 = 'a';
        char ch2 = 'b';
        char ch3 = 'c';
        char plus = '+', minus = '-', multiply;

        char str1[3] = "HI";
        char str2[] = "Hello";

        bool t = true;
        bool f = false;

        /*
                    ค่าคงที่
            การใช้งานค่าคงที่จะต้องใช้ คีย์เวิรด์ const นำหน้า ชนิดข้อมูล และ ชื่อตัวแปร
            ค่าคงที่ไม่เหมือนตัวแปร ที่ตัวแปรจะเปลี่ยนค่าตอนไหนก็ได้ ค่าคงที่ประกาศแล้วไม่สามารถเปลี่ยนค่าได้
        */
        // ตัวอย่าง
        const int myMoney = 1000;
        const short MINNUMBER = 1; // การเขียนค่าคงที่สวนใหญ่จะเน้นชื่อค่าคงที่เป็นตัวพิมพ์ใหญ่
        const int MAXNUMBER = 60;

// การใช้คำสั่ง define
#define X -.4
#define Y .91
}