#include <stdio.h>
#include <stdbool.h>

void main(){
    /*
        เครื่องหมายทางคณิตศาสตร์ที่ไว้ใชคำนวณได้แก่ (Arithmetic Operator)
        +   การบวก
        -   การลบ
        *   การคูณ
        /   การหาร
        %   การหารแบบเอาเศษ

        (Arithmetic Assigndment Operator)
        +=  บวกแล้วเท่ากับ
        -=  ลบแล้วเท่ากับ
        *=  คูณแล้วเท่ากับ
        /=  หารแล้วเท่ากับ
        %=  หารเอาเศษแล้วเท่ากับ

        ++  บวกขึ้น 1 (Increment Operator)
        --  ลดลง 1 (Decrement Operator)
    */

    short n1 = 1 + 1;  // 2
    short n2 = 3 - 6;  // -3
    short n3 = 2 / 2;  // 1
    short n4 = 10 % 2; // 0
    printf("%d %d %d %d" , n1 , n2 ,n3 , n4 );

    // การหารโดยทั่วไปจะได้เลขจำนวนเต็ม
    int n5 = 7.5 / 2;   // 3
    short n6 = 23 / 11; // 2
    printf("%d" , n6);

    /*
        ผลลัพธ์ตามความเป็นจริงแล้ว  7.5 / 2 ต้องเท่ากับ 3.75
        และ 23 / 11 = 2.09...
        เราสามารถเติม ชนิดข้อมูลเป็นรูบแบบ ทศนิยม float หรือ double ให้ตัวแปรเก็บข้อมูลเป็น เลขทสนิยม
        และใช้วิธีการ cast แปลงชนิดข้อมูลจากเลขจำนวนเต็มเป็นเลขทศนิยม โดยให้เติมชนิดข้อมูลหน้าตัวเลขจำนวนเต็ม
    */

    float n7 = 7.5 / 2;                      // 3.75
    float n8 = (float)23 / 11;               // 2.09091
    double n9 = 9 / (float)11;               // 0.818182
    double n10 = (double)9999 / (double)500; // 19.998
    printf("%g %g %g %g", n7, n8, n9, n10);

    int n11 = 5;
    n11 += 5; // 10
    printf("%d" , n11);
    n11 -= 30; // -20
    printf("%d" , n11);

    int n12 = 12;
    int n13 = 3;
    n12 /= n13; // 4
    printf("%d" , n12);

    int n14 = 13;
    n14 %= 12; // 1
    printf("%d" , n14);

    short n15 = 1; // 1
    printf("%d", n15);
    n15++; // 2
    printf("%d", n15);

    short n16 = 9; // 9
    printf("%d", n16);
    n16--; // 8
    printf("%d", n16);
}